Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
df.keys()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [16]:
column = ['A' ,'B', 'C']
index = [0 , 1 , 2]

df1 = pd.DataFrame(columns = column , index = index )

print(df1)
print('\n\nDataframe after reindexing rows: \n',
df1.reindex([ 1 ,2,3]))

     A    B    C
0  NaN  NaN  NaN
1  NaN  NaN  NaN
2  NaN  NaN  NaN


Dataframe after reindexing rows:
      A    B    C
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [19]:
k = {'values' : [50 , 100 , 150 , 200 , 250 , 300] }

In [20]:
df2 = pd.DataFrame(k)

In [21]:
df2

   values
0      50
1     100
2     150
3     200
4     250
5     300

In [25]:
df2[0:3]

   values
0      50
1     100
2     150

In [29]:
df2.sum()

values    1050
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [2]:
import pandas as pd
data = pd.read_csv("https://raw.githubusercontent.com/amankharwal/Website-data/master/articles.csv", encoding = 'latin1')
print(data.head())

                                             Article  \
0  Data analysis is the process of inspecting and...
1  The performance of a machine learning algorith...
2  You must have seen the news divided into categ...
3  When there are only two classes in a classific...
4  The Multinomial Naive Bayes is one of the vari...

                                               Title
0                  Best Books to Learn Data Analysis
1         Assumptions of Machine Learning Algorithms
2          News Classification with Machine Learning
3  Multiclass Classification Algorithms in Machin...
4        Multinomial Naive Bayes in Machine Learning

In [3]:
data["Number of Words"] = data["Article"].apply(lambda n: len(n.split()))
print(data.head())

                                             Article  \
0  Data analysis is the process of inspecting and...
1  The performance of a machine learning algorith...
2  You must have seen the news divided into categ...
3  When there are only two classes in a classific...
4  The Multinomial Naive Bayes is one of the vari...

                                               Title  Number of Words
0                  Best Books to Learn Data Analysis               76
1         Assumptions of Machine Learning Algorithms               56
2          News Classification with Machine Learning               70
3  Multiclass Classification Algorithms in Machin...               66
4        Multinomial Naive Bayes in Machine Learning               96

Q5. How are DataFrame.size() and DataFrame.shape() different?

Shape relates to the size of the dimensions of an N-dimensional array. Size regarding arrays, relates to the amount (or count) of elements that are contained in the array

In [4]:
import pandas as pd
  
# making data frame
data = pd.read_csv(
    "https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# dataframe.size
size = data.size
  
# printing size 
print("Size = {}".format(size))

Size = 4122

In [5]:
import pandas as pd
  
# making data frame
data = pd.read_csv(
    "https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# dataframe.shape
shape = data.shape
  
print("Shape = {}".format(shape))

Shape = (458, 9)

Q6. Which function of pandas do we use to read an excel file?

read_excel() function

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [5]:
a = {"email" : ['priti@domain.com' , "kunal@gmail.com" , "rinal@gmail.com" , "unnu@gmail.com"]}

In [6]:
import pandas as pd
df3 = pd.DataFrame(a)

In [7]:
df3

              email
0  priti@domain.com
1   kunal@gmail.com
2   rinal@gmail.com
3    unnu@gmail.com

In [23]:
df = pd.DataFrame({"email" : ['priti@domain.com' , "kunal@gmail.com" , "rinal@gmail.com" , "unnu@gmail.com"]})

df['username'] = df['email'].apply(lambda x: x.split('@')[0])

In [24]:
df

              email username
0  priti@domain.com    priti
1   kunal@gmail.com    kunal
2   rinal@gmail.com    rinal
3    unnu@gmail.com     unnu

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [5]:
import pandas as pd
df4 = pd.DataFrame({"A" : [3,8,6,2,9] , 
                   "B" : [5,2,9,3,1],
                   "C" : [1,7,4,5,2]})

In [6]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [13]:
df4_new = df4[df4["A" < 5 & "B" > 10]]

TypeError: unsupported operand type(s) for &: 'int' and 'str'

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [14]:
import pandas as pd 
s = pd.Series(data = [5, 9, 8, 5, 7, 8, 1, 2, 3,
                      4, 5, 6, 7, 8, 9, 5, 3])

In [15]:
print(s)

0     5
1     9
2     8
3     5
4     7
5     8
6     1
7     2
8     3
9     4
10    5
11    6
12    7
13    8
14    9
15    5
16    3
dtype: int64

In [16]:
print(s.mean())

5.588235294117647

In [18]:
print(s.median())

5.0

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [19]:
df6 = pd.DataFrame({"Sales" : [45 , 26, 89 , 78 , 63 , 77] , 
                   "Data" : [ 7 , 8, 9, 2 , 3, 5 ]})

In [20]:
df6

   Sales  Data
0     45     7
1     26     8
2     89     9
3     78     2
4     63     3
5     77     5

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [43]:
import pandas as pd

df7 = pd.DataFrame({ "Date" : [ '2023-1-1' , '2023-1-2' , '2023-1-3' , '2023-1-4' ,'2023-1-5']})

In [44]:
df7

       Date
0  2023-1-1
1  2023-1-2
2  2023-1-3
3  2023-1-4
4  2023-1-5

In [60]:
df7["Weekday"] = ["sunday" , "monday" , "tuesday" , "wednesday" , "thursday"]

In [61]:
df7

       Date    Weekday
0  2023-1-1     sunday
1  2023-1-2     monday
2  2023-1-3    tuesday
3  2023-1-4  wednesday
4  2023-1-5   thursday